---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCProductWrapper.AddFinishMaterial(Autodesk.Revit.DB.IFC.IFCAnyHandle)
source: html/68339fc8-168c-1780-d477-155a7204a37c.htm
---
# Autodesk.Revit.DB.IFC.IFCProductWrapper.AddFinishMaterial Method

Adds a material handle to associate with the IfcProduct in this wrapper.

## Syntax (C#)
```csharp
public void AddFinishMaterial(
	IFCAnyHandle material
)
```

## Parameters
- **material** (`Autodesk.Revit.DB.IFC.IFCAnyHandle`) - The material handle.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null